STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/BLE_Zigbee/ZigbeeDirect_OnOff/STM32_WPAN/App/app_ble.c
        /* USER CODE END EVT_DISCONN_COMPLETE_2 */
      }
      gap_cmd_resp_release();

      /* USER CODE BEGIN EVT_DISCONN_COMPLETE_1 */
      notification_wrapper.Opcode = BLE_ZDD_WRAP_HCI_DISCONNECTION_COMPLETE_EVT;
      notification_wrapper.ConnectionHandle = p_disconnection_complete_event->Connection_Handle;
      ZDD_Stack_Notification(&notification_wrapper);
      /* USER CODE END EVT_DISCONN_COMPLETE_1 */
      DISHandleNotification.EvtOpcode = DIS_DISCON_HANDLE_EVT;
      ZIGBEEDIRECTCOMMHandleNotification.EvtOpcode = ZIGBEEDIRECTCOMM_DISCON_HANDLE_EVT;
      ZDDSECURITYHandleNotification.EvtOpcode = ZDDSECURITY_DISCON_HANDLE_EVT;
      TUNNELINGHandleNotification.EvtOpcode = TUNNELING_DISCON_HANDLE_EVT;
      DISHandleNotification.ConnectionHandle = p_disconnection_complete_event->Connection_Handle;
      ZIGBEEDIRECTCOMMHandleNotification.ConnectionHandle = p_disconnection_complete_event->Connection_Handle;
      ZDDSECURITYHandleNotification.ConnectionHandle = p_disconnection_complete_event->Connection_Handle;
      TUNNELINGHandleNotification.ConnectionHandle = p_disconnection_complete_event->Connection_Handle;
      DIS_APP_EvtRx(&DISHandleNotification);
      ZIGBEEDIRECTCOMM_APP_EvtRx(&ZIGBEEDIRECTCOMMHandleNotification);
      ZDDSECURITY_APP_EvtRx(&ZDDSECURITYHandleNotification);
      TUNNELING_APP_EvtRx(&TUNNELINGHandleNotification);
      /* USER CODE BEGIN EVT_DISCONN_COMPLETE */

      /* USER CODE END EVT_DISCONN_COMPLETE */
      break; /* HCI_DISCONNECTION_COMPLETE_EVT_CODE */
    }
    case HCI_HARDWARE_ERROR_EVT_CODE:
    {
       hci_hardware_error_event_rp0 *p_hardware_error_event;

       p_hardware_error_event = (hci_hardware_error_event_rp0 *)p_event_pckt->data;
       UNUSED(p_hardware_error_event);
       APP_DBG_MSG(">>== HCI_HARDWARE_ERROR_EVT_CODE\n");
       APP_DBG_MSG("Hardware Code = 0x%02X\n",p_hardware_error_event->Hardware_Code);
       /* USER CODE BEGIN HCI_EVT_LE_HARDWARE_ERROR */

       /* USER CODE END HCI_EVT_LE_HARDWARE_ERROR */
       break; /* HCI_HARDWARE_ERROR_EVT_CODE */
    }
    case HCI_LE_META_EVT_CODE:
    {
      p_meta_evt = (evt_le_meta_event*) p_event_pckt->data;
      /* USER CODE BEGIN EVT_LE_META_EVENT */

      /* USER CODE END EVT_LE_META_EVENT */
      switch (p_meta_evt->subevent)
      {
        case HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE:
        {
          uint32_t conn_interval_us = 0;
          hci_le_connection_update_complete_event_rp0 *p_conn_update_complete;
          p_conn_update_complete = (hci_le_connection_update_complete_event_rp0 *) p_meta_evt->data;
          conn_interval_us = p_conn_update_complete->Conn_Interval * 1250;
          LOG_INFO_APP(">>== HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE\n");
          LOG_INFO_APP("     - Connection Interval:   %d.%02d ms\n     - Connection latency:    %d\n     - Supervision Timeout:   %d ms\n",
                       conn_interval_us / 1000,
                       (conn_interval_us%1000) / 10,
                       p_conn_update_complete->Conn_Latency,
                       p_conn_update_complete->Supervision_Timeout*10);
          UNUSED(conn_interval_us);
          UNUSED(p_conn_update_complete);

          /* USER CODE BEGIN EVT_LE_CONN_UPDATE_COMPLETE */

          /* USER CODE END EVT_LE_CONN_UPDATE_COMPLETE */
          break;
        }
        case HCI_LE_PHY_UPDATE_COMPLETE_SUBEVT_CODE:
        {
          hci_le_phy_update_complete_event_rp0 *p_le_phy_update_complete;
          p_le_phy_update_complete = (hci_le_phy_update_complete_event_rp0*)p_meta_evt->data;
          UNUSED(p_le_phy_update_complete);

          gap_cmd_resp_release();

          /* USER CODE BEGIN EVT_LE_PHY_UPDATE_COMPLETE */

          /* USER CODE END EVT_LE_PHY_UPDATE_COMPLETE */
          break;
        }
        case HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE:
        {
          uint32_t conn_interval_us = 0;
          hci_le_enhanced_connection_complete_event_rp0 *p_enhanced_conn_complete;
          p_enhanced_conn_complete = (hci_le_enhanced_connection_complete_event_rp0 *) p_meta_evt->data;
          conn_interval_us = p_enhanced_conn_complete->Conn_Interval * 1250;
          LOG_INFO_APP(">>== HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE - Connection handle: 0x%04X\n", p_enhanced_conn_complete->Connection_Handle);
          LOG_INFO_APP("     - Connection established with @:%02x:%02x:%02x:%02x:%02x:%02x\n",
                      p_enhanced_conn_complete->Peer_Address[5],
                      p_enhanced_conn_complete->Peer_Address[4],
                      p_enhanced_conn_complete->Peer_Address[3],
                      p_enhanced_conn_complete->Peer_Address[2],
                      p_enhanced_conn_complete->Peer_Address[1],
                      p_enhanced_conn_complete->Peer_Address[0]);
          LOG_INFO_APP("     - Connection Interval:   %d.%02d ms\n     - Connection latency:    %d\n     - Supervision Timeout:   %d ms\n     - Status:              0x%02X\n",
                      conn_interval_us / 1000,
                      (conn_interval_us%1000) / 10,
                      p_enhanced_conn_complete->Conn_Latency,
                      p_enhanced_conn_complete->Supervision_Timeout * 10,
                      p_enhanced_conn_complete->Status
                     );
          UNUSED(conn_interval_us);

          if (bleAppContext.Device_Connection_Status == APP_BLE_LP_CONNECTING)
          {
            /* Connection as client */
            bleAppContext.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;
          }
          else
          {
            /* Connection as server */
            bleAppContext.Device_Connection_Status = APP_BLE_CONNECTED_SERVER;
          }
          bleAppContext.BleApplicationContext_legacy.connectionHandle = p_enhanced_conn_complete->Connection_Handle;

          DISHandleNotification.EvtOpcode = DIS_CONN_HANDLE_EVT;
          ZIGBEEDIRECTCOMMHandleNotification.EvtOpcode = ZIGBEEDIRECTCOMM_CONN_HANDLE_EVT;
          ZDDSECURITYHandleNotification.EvtOpcode = ZDDSECURITY_CONN_HANDLE_EVT;
          TUNNELINGHandleNotification.EvtOpcode = TUNNELING_CONN_HANDLE_EVT;
          DISHandleNotification.ConnectionHandle = p_enhanced_conn_complete->Connection_Handle;
          ZIGBEEDIRECTCOMMHandleNotification.ConnectionHandle = p_enhanced_conn_complete->Connection_Handle;
          ZDDSECURITYHandleNotification.ConnectionHandle = p_enhanced_conn_complete->Connection_Handle;
          TUNNELINGHandleNotification.ConnectionHandle = p_enhanced_conn_complete->Connection_Handle;
          DIS_APP_EvtRx(&DISHandleNotification);
          ZIGBEEDIRECTCOMM_APP_EvtRx(&ZIGBEEDIRECTCOMMHandleNotification);
          ZDDSECURITY_APP_EvtRx(&ZDDSECURITYHandleNotification);
          TUNNELING_APP_EvtRx(&TUNNELINGHandleNotification);
          /* USER CODE BEGIN HCI_EVT_LE_ENHANCED_CONN_COMPLETE */
          notification_wrapper.Opcode = BLE_ZDD_WRAP_HCI_LE_META_EVT_HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT;
          notification_wrapper.ConnectionHandle = p_enhanced_conn_complete->Connection_Handle;
          ZDD_Stack_Notification(&notification_wrapper);
          /* USER CODE END HCI_EVT_LE_ENHANCED_CONN_COMPLETE */
          break; /* HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE */
        }
        case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
        {
          uint32_t conn_interval_us = 0;
          hci_le_connection_complete_event_rp0 *p_conn_complete;
          p_conn_complete = (hci_le_connection_complete_event_rp0 *) p_meta_evt->data;
          conn_interval_us = p_conn_complete->Conn_Interval * 1250;
          LOG_INFO_APP(">>== HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE - Connection handle: 0x%04X\n", p_conn_complete->Connection_Handle);
          LOG_INFO_APP("     - Connection established with @:%02x:%02x:%02x:%02x:%02x:%02x\n",
                      p_conn_complete->Peer_Address[5],
                      p_conn_complete->Peer_Address[4],
                      p_conn_complete->Peer_Address[3],
                      p_conn_complete->Peer_Address[2],
                      p_conn_complete->Peer_Address[1],
                      p_conn_complete->Peer_Address[0]);
          LOG_INFO_APP("     - Connection Interval:   %d.%02d ms\n     - Connection latency:    %d\n     - Supervision Timeout:   %d ms     - Status:              0x%02X\n",
                      conn_interval_us / 1000,
                      (conn_interval_us%1000) / 10,
                      p_conn_complete->Conn_Latency,
                      p_conn_complete->Supervision_Timeout * 10,
                      p_conn_complete->Status
                     );
          UNUSED(conn_interval_us);

          if (bleAppContext.Device_Connection_Status == APP_BLE_LP_CONNECTING)
          {
            /* Connection as client */
            bleAppContext.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;
          }
          else
          {
            /* Connection as server */
            bleAppContext.Device_Connection_Status = APP_BLE_CONNECTED_SERVER;
          }
          bleAppContext.BleApplicationContext_legacy.connectionHandle = p_conn_complete->Connection_Handle;

          DISHandleNotification.EvtOpcode = DIS_CONN_HANDLE_EVT;
          ZIGBEEDIRECTCOMMHandleNotification.EvtOpcode = ZIGBEEDIRECTCOMM_CONN_HANDLE_EVT;
          ZDDSECURITYHandleNotification.EvtOpcode = ZDDSECURITY_CONN_HANDLE_EVT;
          TUNNELINGHandleNotification.EvtOpcode = TUNNELING_CONN_HANDLE_EVT;
          DISHandleNotification.ConnectionHandle = p_conn_complete->Connection_Handle;
          ZIGBEEDIRECTCOMMHandleNotification.ConnectionHandle = p_conn_complete->Connection_Handle;
          ZDDSECURITYHandleNotification.ConnectionHandle = p_conn_complete->Connection_Handle;
          TUNNELINGHandleNotification.ConnectionHandle = p_conn_complete->Connection_Handle;
          DIS_APP_EvtRx(&DISHandleNotification);
          ZIGBEEDIRECTCOMM_APP_EvtRx(&ZIGBEEDIRECTCOMMHandleNotification);
          ZDDSECURITY_APP_EvtRx(&ZDDSECURITYHandleNotification);
          TUNNELING_APP_EvtRx(&TUNNELINGHandleNotification);
          /* USER CODE BEGIN HCI_EVT_LE_CONN_COMPLETE */
          notification_wrapper.Opcode = BLE_ZDD_WRAP_HCI_LE_META_EVT_HCI_LE_CONNECTION_COMPLETE_SUBEVT;
          notification_wrapper.ConnectionHandle = p_conn_complete->Connection_Handle;
          notification_wrapper.ConnInterval = p_conn_complete->Conn_Interval;
          ZDD_Stack_Notification(&notification_wrapper);
          /* USER CODE END HCI_EVT_LE_CONN_COMPLETE */
          break; /* HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */
        }
        /* USER CODE BEGIN SUBEVENT */

        /* USER CODE END SUBEVENT */
        default:
        {
          /* USER CODE BEGIN SUBEVENT_DEFAULT */

          /* USER CODE END SUBEVENT_DEFAULT */
          break;
        }
      }

      /* USER CODE BEGIN META_EVT */

      /* USER CODE END META_EVT */
    }
    break; /* HCI_LE_META_EVT_CODE */

    case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
    {
      p_blecore_evt = (evt_blecore_aci*) p_event_pckt->data;
      /* USER CODE BEGIN EVT_VENDOR */

      /* USER CODE END EVT_VENDOR */
      switch (p_blecore_evt->ecode)
      {
        /* USER CODE BEGIN ECODE */

        /* USER CODE END ECODE */
        case ACI_L2CAP_CONNECTION_UPDATE_RESP_VSEVT_CODE:
        {
          aci_l2cap_connection_update_resp_event_rp0 *p_l2cap_conn_update_resp;
          p_l2cap_conn_update_resp = (aci_l2cap_connection_update_resp_event_rp0 *) p_blecore_evt->data;
          UNUSED(p_l2cap_conn_update_resp);
          /* USER CODE BEGIN EVT_L2CAP_CONNECTION_UPDATE_RESP */

