STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/BLE_Zigbee/ZigbeeDirect_OnOff/STM32_WPAN/App/app_ble.c
  /* USER CODE END Procedure_Gap_Peripheral_2 */

  /* Call ACI APIs */
  switch(ProcGapPeripheralId)
  {
    case PROC_GAP_PERIPH_ADVERTISE_START_FAST:
    case PROC_GAP_PERIPH_ADVERTISE_START_LP:
    case PROC_GAP_PERIPH_ADVERTISE_NON_CONN_START_FAST:
    case PROC_GAP_PERIPH_ADVERTISE_NON_CONN_START_LP:
    {
      /* Start Advertising */
      status = aci_gap_set_discoverable(paramD,
                                        paramA,
                                        paramB,
                                        CFG_BD_ADDRESS_TYPE,
                                        ADV_FILTER,
                                        0, 0, 0, 0, 0, 0);
      if (status != BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("==>> aci_gap_set_discoverable - fail, result: 0x%02X\n", status);
      }
      else
      {
        bleAppContext.Device_Connection_Status = (APP_BLE_ConnStatus_t)paramC;
        LOG_INFO_APP("==>> aci_gap_set_discoverable - Success\n");
      }

      status = aci_gap_delete_ad_type(AD_TYPE_TX_POWER_LEVEL);
      if (status != BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("==>> delete tx power level - fail, result: 0x%02X\n", status);
      }

      /* Update Advertising data */
      uint8_t *adv_data_p;
      uint8_t adv_data_len;

      adv_data_p = &a_AdvData[0];
      adv_data_len = sizeof(a_AdvData);
      /* USER CODE BEGIN ADV_DATA_UPDATE_1 */
      memcpy(&adv_data[0], &a_AdvData[0], sizeof(a_AdvData));
      memcpy(&adv_data[sizeof(a_AdvData)], &a_ExtAdvData[0], sizeof(a_ExtAdvData));
      adv_data_p = adv_data; /* Override */
      adv_data_len = sizeof(adv_data);
      /* USER CODE END ADV_DATA_UPDATE_1 */
      status = aci_gap_update_adv_data(adv_data_len, adv_data_p);
      if (status != BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("==>> Start Advertising Failed, result: 0x%02X\n", status);
      }
      else
      {
        LOG_INFO_APP("==>> Success: Start Advertising\n");
      }
      break;
    }
    case PROC_GAP_PERIPH_ADVERTISE_STOP:
    {
      status = aci_gap_set_non_discoverable();
      if (status != BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("aci_gap_set_non_discoverable - fail, result: 0x%02X\n",status);
      }
      else
      {
        LOG_INFO_APP("==>> aci_gap_set_non_discoverable - Success\n");
        if (bleAppContext.BleApplicationContext_legacy.connectionHandle != 0xFFFF)
        {
          bleAppContext.Device_Connection_Status = APP_BLE_CONNECTED_SERVER;
        }
        else
        {
          bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
        }
      }
      break;
    }/* PROC_GAP_PERIPH_ADVERTISE_STOP */
    case PROC_GAP_PERIPH_ADVERTISE_DATA_UPDATE:
    {
      uint8_t *adv_data_p;
      uint8_t adv_data_len;

      adv_data_p = &a_AdvData[0];
      adv_data_len = sizeof(a_AdvData);
      /* USER CODE BEGIN ADV_DATA_UPDATE_2 */

      /* USER CODE END ADV_DATA_UPDATE_2 */
      status = aci_gap_update_adv_data(adv_data_len, adv_data_p);
      if (status != BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("aci_gap_update_adv_data - fail, result: 0x%02X\n",status);
      }
      else
      {
        LOG_INFO_APP("==>> aci_gap_update_adv_data - Success\n");
      }

      break;
    }/* PROC_GAP_PERIPH_ADVERTISE_DATA_UPDATE */
    case PROC_GAP_PERIPH_CONN_PARAM_UPDATE:
    {
       status = aci_l2cap_connection_parameter_update_req(
                                                       bleAppContext.BleApplicationContext_legacy.connectionHandle,
                                                       paramA,
                                                       paramB,
                                                       paramC,
                                                       paramD);
      if (status != BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("aci_l2cap_connection_parameter_update_req - fail, result: 0x%02X\n",status);
      }
      else
      {
        LOG_INFO_APP("==>> aci_l2cap_connection_parameter_update_req - Success\n");
      }

      break;
    }/* PROC_GAP_PERIPH_CONN_PARAM_UPDATE */
    /* USER CODE BEGIN ACI_CALL */

    /* USER CODE END ACI_CALL */
    default:
      break;
  }

  /* USER CODE BEGIN Procedure_Gap_Peripheral_3 */

  /* USER CODE END Procedure_Gap_Peripheral_3 */
  return;
}

const uint8_t* BleGetBdAddress(void)
{
  const uint8_t *p_bd_addr;

  p_bd_addr = (const uint8_t *)a_BdAddr;

  return p_bd_addr;
}

/* USER CODE BEGIN FD */

static void APP_BLE_StartAdvertising(uint16_t pan_id, uint16_t nwk_addr, bool pjoin)
{
  bool is_service_data_present = false;
  uint8_t *adv_data_p;
  uint8_t adv_data_len;
  uint8_t i;
  uint8_t ad_length;
  uint8_t ad_type;

  adv_data_p = &a_ExtAdvData[0];
  adv_data_len = sizeof(a_ExtAdvData);
  i = 0;

  /* Find the Service Data AD Type and update the contents */
  while (i <adv_data_len)
  {
    ad_length = adv_data_p[i++];
    ad_type = adv_data_p[i];
    if (ad_type != AD_TYPE_SERVICE_DATA)
    {
      i += ad_length; /* Skip */
      continue;
    }
    else
    {
      is_service_data_present = true;
      i++; /* Enter */
    }
    i += 2; /* Skip UUID */

    /* Flags */
    /* version = 0x01
     * tunnel support = 0x10
     * permit join = 0x20 */
    adv_data_p[i] = 0x11U;
    if (pjoin) {
        adv_data_p[i] |= 0x20U;
    }
    i++;
    /* PAN ID */
    putle16(&adv_data_p[i], pan_id);
    i += 2;
    /* Short Address */
    putle16(&adv_data_p[i], nwk_addr);
    i += 2;
  }

  if (is_service_data_present)
  {
    APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_FAST);
  }
  else
  {
    LOG_ERROR_APP("Error, AD_TYPE_SERVICE_DATA missing from BLE advertisement data.");
  }
}

bool BLE_App_Notification(BLE_App_Notification_evt_t *pNotification)
{
  bool ret = true;
  TUNNELING_Data_t tunneling_data;
  ZDDSECURITY_Data_t zddsecurity_data;
  ZIGBEEDIRECTCOMM_Data_t zigbeedirectcomm_data;

  switch(pNotification->Opcode)
  {
    case ZDD_BLE_WRAP_TUNNELING_TUNNZDTSNPDU_UPDATEVALUE_EVT:
      tunneling_data.Length = pNotification->Data.Length;
      tunneling_data.p_Payload = pNotification->Data.pPayload;
      ret = TUNNELING_UpdateValue(TUNNELING_TUNNZDTSNPDU, &tunneling_data);
      break;
    case ZDD_BLE_WRAP_ZDDSECURITY_SECURITY25519AES_UPDATEVALUE_EVT:
    case ZDD_BLE_WRAP_ZDDSECURITY_SECURITY25519SHA_UPDATEVALUE_EVT:
    case ZDD_BLE_WRAP_ZDDSECURITY_SECURITY_P256SHA_UPDATEVALUE_EVT:
      zddsecurity_data.Length = pNotification->Data.Length;
      zddsecurity_data.p_Payload = pNotification->Data.pPayload;
      if (pNotification->Opcode == ZDD_BLE_WRAP_ZDDSECURITY_SECURITY25519AES_UPDATEVALUE_EVT)
      {
        ret = ZDDSECURITY_UpdateValue(ZDDSECURITY_SECURITY25519AES, &zddsecurity_data);
      }
      else if (pNotification->Opcode == ZDD_BLE_WRAP_ZDDSECURITY_SECURITY25519SHA_UPDATEVALUE_EVT)
      {
        ret = ZDDSECURITY_UpdateValue(ZDDSECURITY_SECURITY25519SHA, &zddsecurity_data);
      }
      else if (pNotification->Opcode == ZDD_BLE_WRAP_ZDDSECURITY_SECURITY_P256SHA_UPDATEVALUE_EVT)
      {
        ret = ZDDSECURITY_UpdateValue(ZDDSECURITY_P256SHA, &zddsecurity_data);
      }
      break;
    case ZDD_BLE_WRAP_ZIGBEEDIRECTCOMM_COMMSTATUS_UPDATEVALUE_EVT:
      zigbeedirectcomm_data.Length = pNotification->Data.Length;
      zigbeedirectcomm_data.p_Payload = pNotification->Data.pPayload;
      ret = ZIGBEEDIRECTCOMM_UpdateValue(ZIGBEEDIRECTCOMM_COMMSTATUS, &zigbeedirectcomm_data);
      break;
    case ZDD_BLE_WRAP_BLE_START_ADVERTISING_EVT:
      APP_BLE_StartAdvertising(pNotification->AdvData.PanId,
                               pNotification->AdvData.NwkAddr,
                               pNotification->AdvData.PJoin);
      break;
    case ZDD_BLE_WRAP_BLE_STOP_ADVERTISING_EVT:
      APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_STOP);
      break;
    case ZDD_BLE_WRAP_OS_SHCEDULE_ZDD_TASK_EVT:
      UTIL_SEQ_SetTask(1u << CFG_TASK_ZIGBEE_ZDD, CFG_SEQ_PRIO_1);
      break;
    default:
      ret = false;
      break;
  }

  return ret;
}

void APP_BLE_HostNvmStore(void)
{
  /* Start SNVMA write procedure */
  SNVMA_Write(APP_BLE_NvmBuffer, BLE_NvmCallback);
}

/* USER CODE END FD */

